#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_UAT/DSR_USER"]: Refreshing state... [id=d106947f-49e5-4b46-aa82-ee64ad314736/fcb22564-e254-4bb2-8ebf-4596a1ab1330]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_SIT/DSR_USER"]: Refreshing state... [id=d106947f-49e5-4b46-aa82-ee64ad314736/c31af1e0-f13b-4505-8b55-c437fdacffb5]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_CONF/DSR_USER"]: Refreshing state... [id=d106947f-49e5-4b46-aa82-ee64ad314736/6c3b9d2b-e51e-4e47-a698-3597ca4e19a2]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/DSR_USER"]: Refreshing state... [id=d106947f-49e5-4b46-aa82-ee64ad314736/41a5dd49-9708-482b-b789-d79f46e573a0]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_CONF/DSR_USER"]: Refreshing state... [id=moh_applications/client/bf1a894f-9665-42b7-96e5-c9ee90bef5fb/scope-mappings/c0fe2e9f-6937-4ffa-9296-d786d9b0a98b/6c3b9d2b-e51e-4e47-a698-3597ca4e19a2]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_SIT/DSR_USER"]: Refreshing state... [id=moh_applications/client/bf1a894f-9665-42b7-96e5-c9ee90bef5fb/scope-mappings/1197df69-9199-49a5-a49a-c7d43d35551c/c31af1e0-f13b-4505-8b55-c437fdacffb5]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_REV/DSR_USER"]: Refreshing state... [id=moh_applications/client/bf1a894f-9665-42b7-96e5-c9ee90bef5fb/scope-mappings/20e896f4-bf43-43ed-9441-d166e0513f34/41a5dd49-9708-482b-b789-d79f46e573a0]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_UAT/DSR_USER"]: Refreshing state... [id=moh_applications/client/bf1a894f-9665-42b7-96e5-c9ee90bef5fb/scope-mappings/045f3224-9637-4785-a661-fc6f028804d2/fcb22564-e254-4bb2-8ebf-4596a1ab1330]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_IAT/DSR_USER"]: Refreshing state... [id=moh_applications/client/bf1a894f-9665-42b7-96e5-c9ee90bef5fb/scope-mappings/a837283e-f96e-446d-9c51-5ac7d0eab773/08f14258-e522-4116-ae91-9cdda9ada3e9]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-DBA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/9ada1d3b-be63-40a3-84f2-e4ec0e10be88]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-MIDTIER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/782fe94e-79a2-438f-9bc1-28717395b28d]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-QA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/658f081c-a8b0-4c1b-b9ee-7e8901158ce7]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/27967216-03f7-4259-b50a-955b995d51ad]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-QA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/1798203d-027f-4856-a445-8a90c1dc9756]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/ba2aead8-cd2d-4519-991b-3bd44c71c057]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-MID-TIER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/4e3d322a-fbe7-438d-8ee7-95a1707d40dc]
module.KEYCLOAK_PROD.module.moh_applications.module.DMFT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PIDP-SERVICE/view_endorsement_data"]: Refreshing state... [id=68a46e0b-2861-4850-8cb3-dfae13e47ca3/0c2d08b1-b900-4b0c-a4d3-9e6e3e1ef847]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/ADMIN"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/7489c26e-77c8-47ad-9c07-a9bb97a37d91]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-AM-TEAM.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/053fa749-b569-4258-bc9e-bc8ca0541dfe]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["account/view-profile"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/60dfb3b9-5ceb-4498-a24c-9641796bd991/43bf4fca-777a-4c9c-9127-f9677c654fef]
module.KEYCLOAK_PROD.module.moh_applications.module.DMFT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/view_endorsement_data"]: Refreshing state... [id=moh_applications/client/c87f3feb-3c06-4d61-a5c2-48c593cccd1b/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/0c2d08b1-b900-4b0c-a4d3-9e6e3e1ef847]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_pidp_demo"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/86ec4f91-45fb-4e65-ae4f-e1b952fd4e47]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/USER"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/65d6f8b7-0703-46ed-9ced-55457bd6c14b]
module.KEYCLOAK_PROD.module.moh_applications.module.CGI-AM-TEAM.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/270966e6-985c-4d55-a35c-53e32ab4cf46]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-AM-TEAM.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/eb2dce73-6fe7-4b63-8b7a-c5995a530714]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.KEYCLOAK_PROD.module.moh_applications.module.ALR.module.client-roles.keycloak_role.ROLES["ALR_Data_Investigator"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "d57805a3-cf28-408c-9656-e17195aa70da"
        name       = "ALR_Data_Investigator"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.ALR.module.client-roles.keycloak_role.ROLES["ALR_Data_Investigator"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "36e6d323-23fa-4563-b3ab-a258a11144f9"
        name       = "ALR_Data_Investigator"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_PROD.module.moh_applications.module.EDRD-MANAGEMENT.keycloak_group.GROUP will be created
  + resource "keycloak_group" "GROUP" {
      + id       = (known after apply)
      + name     = "EDRD Management"
      + path     = (known after apply)
      + realm_id = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.EDRD-MANAGEMENT.keycloak_group_roles.GROUP_ROLES will be created
  + resource "keycloak_group_roles" "GROUP_ROLES" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "moh_applications"
      + role_ids   = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-edrd"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "64028a9d-1033-438f-8db8-681dc0a97e51"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-edrd"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "bd2e86ec-254f-4ddf-82f3-6e31e70b5bd8"
      + id        = (known after apply)
      + name      = "view-client-edrd"
      + realm_id  = "moh_applications"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*